[
    "Well done on achieving your goal! I guess miracles do happen.",
    "Congrats! You've proven that persistence really can pay off... eventually.",
    "Impressive work! I didn't think you'd actually follow through.",
    "You did it! Now we just need to work on efficiency.",
    "You've reached your goal! It only took twice as long as expected.",
    "You guessed it! Who knew guessing could be your hidden talent?",
    "Wow, you got it right! I guess even a stopped clock is right twice a day.",
    "You guessed the word! I was starting to think you'd never get it.",
    "Nice guess! Your random stabs in the dark finally paid off.",
    "You guessed the word! I'm almost as surprised as you are.",
    "You played the game so well! Beginner's luck must really love you.",
    "Nice playing! Who knew you had such hidden potential?",
    "Great job! You really exceeded my low expectations.",
    "Well played! I didn't think you'd make it this far.",
    "You did great! And here I thought you'd give up.",
    "You found the solution! I knew you could do it... eventually.",
    "Great job! I was starting to think we'd need a miracle.",
    "You solved it! I didn't even have to bribe you with snacks.",
    "Wow, you found the solution! I guess lightning does strike twice.",
    "You did it! I’m almost as impressed as I am surprised.",
    "Fantastic! You solved it without consulting Google... this time.",
    "You found the solution! And it only took twice as long as expected.",
    "You did it! Who knew you had a Sherlock Holmes in you?",
    "Amazing! You found the solution and didn’t even break anything.",
    "You solved it! I was getting ready to call in the experts.",
    "Great job! I was starting to lose hope.",
    "You found the solution! I’ll admit, I had my doubts.",
    "You did it! I guess persistence really does pay off.",
    "Nice work! I was expecting to be here all day.",
    "You found the solution! Maybe you should try for Mensa next.",
    "You did it! And here I thought we’d be stuck forever.",
    "Amazing! You cracked it just before I ran out of patience.",
    "You found the solution! I’m genuinely impressed and slightly confused.",
    "Great job! Now, can you solve world peace next?",
    "You did it! I guess even the most complex problems have simple solutions... eventually."
  ]
  